Revit 2027 API
CircuitNamingScheme.Create Method
 Creates a new CircuitNamingScheme.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static CircuitNamingScheme Create(
	Document document,
	string name,
	IList<TableCellCombinedParameterData> data
)
Public Shared Function Create (
	document As Document,
	name As String,
	data As IList(Of TableCellCombinedParameterData)
) As CircuitNamingScheme
public:
static CircuitNamingScheme^ Create(
	Document^ document,
	String^ name,
	IList<TableCellCombinedParameterData^>^ data
)
static member Create :
        document : Document *
        name : string *
        data : IList<TableCellCombinedParameterData> -> CircuitNamingScheme
Parameters
document Document
 The document in which to create the CircuitNamingScheme.
name String
 The name of CircuitNamingScheme.
data IList<TableCellCombinedParameterData>
 The array of TableCellCombinedParameterData to be set as combined parameters.
Return Value
CircuitNamingScheme
 The newly created CircuitNamingScheme.
Exceptions
Exception | Condition
ArgumentException |  name is an empty string or contains only whitespace. -or- name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~". -or- The given value for name is already in use as a CircuitNamingScheme name. -or- The data contains invalid parameter id.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
CircuitNamingScheme Class
Autodesk.Revit.DB.Electrical Namespace